import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-our-rooms',
  templateUrl: './our-rooms.component.html',
  styleUrls: ['./our-rooms.component.scss']
})
export class OurRoomsComponent implements OnInit {
  ps5VIPText: string;
  ps5Text: string;
  gamingPcText: string; // שינוי השם לסימון מתחם המחשבים
  vrText: string;

  constructor() {
    this.ps5VIPText = ''; 
    this.ps5Text = ''; 
    this.gamingPcText = ''; // שינוי השם למתחם המחשבים
    this.vrText = ''; 
  }

  ngOnInit() {
    this.ps5Text = `מתחם הסוני פלייסטיישן הוא הלב הפועם של איבופליי, זהו מקום שבו תוכלו להינות מפרטיות עם עיצוב מרשים וחדשני,
    החדר עטוף בקירות זכוכית ובידוד אקוסטי מעולה שמבטיח שום הפרעות. נוסף על כך, אבזור המשחקים מהשורה הראשונה וכל זה כדי להבטיח לכם את החוויה המושלמת!
    אז, ישיבה טובה עם החבר'ה, עם בירות ונשנושים ומפה הכדור עובר לידיים שלכם.`.replace(/\.\s/g, ".\n");

    this.ps5VIPText = `חדרי הפלייסטיישן וי אי פי הם בדיוק המקום לכל אותם שחקנים שמחפשים לבלות עם החבר'ה בפרטיות מוחלטת בחדר יוקרתי ומבאובזר,
    החדרים הפרטיים של איבופליי מעניקים תחושה נהדרת לשחקנים עם מערכת סאונד מצוינת וטלוויזית לד גדולה ואיכותית במיוחד, בנוסף לכך גודלו של החדר מתאים בקלות לקבוצה של בין 6-8 אנשים.
    אז אוהבים את השקט והפרטיות? זה המקום בשבילכם `.replace(/\.\s/g, ".\n");

    this.gamingPcText = `ברוכים הבאים למתחם עמדות המחשב של איבופליי! זה המקום שבו תוכלו לשקוע בעולם המשחקים המתקדם ביותר וליהנות ממחשבי גיימינג מקצועיים עם ביצועים גבוהים.
    המתחם מאובזר בציוד גיימינג חדשני, כולל מסכים באיכות מעולה, כרטיסי גרפיקה חזקים, ומגוון משחקים מובילים. כאן תוכלו להתחרות מול חברים, או פשוט להירגע ולצלול לתוך משחקים אהובים.
    אנחנו מזמינים אתכם לחוות את המשחקים בדרך חדשה ומרגשת.`.replace(/\.\s/g, ".\n");

    this.vrText = `הדובדבן שבקצפת - מי לא אוהב להרגיש שהוא לרגע אחד יוצא מהעולם המציאותי ועובר אל העולם הוירטואלי?
    בחדר הזה תוכלו להרגיש את זה בכל המובנים, חדר המציאות הוירטואלית כולל בתוכו מערכות שלמות עם הליכונים וציוד מתקדם וטכנולוגי
    שיתן לכם הרגשה שקשה לתאר במילים, ועוד דבר קטן, במערכות שלנו אפשר לשחק האחד נגד השני במשחק יריות.`.replace(/\.\s/g, ".\n");  
  }
  showImagePopup: boolean = false;
  popupImageUrl: string = '';

  openImagePopup(imageUrl: string): void {
    this.popupImageUrl = imageUrl;
    this.showImagePopup = true;
  }

  closeImagePopup(): void {
    this.showImagePopup = false;
  }
}
