import { Component } from '@angular/core';

@Component({
  selector: 'app-company-events',
  templateUrl: './company-events.component.html',
  styleUrls: ['./company-events.component.scss']
})
export class CompanyEventsComponent {
  events = [
    {
      title: 'אירועי חברה',
      description: 'מתכננים אירוע חברה בלתי נשכח? אנו מזמינים אתכם לערב שכולו אדרנלין, כיף ותחרותיות! מגוון חדרי הגיימינג שלנו מציעים חוויה שמתאימה לחברות המעוניינות לחבר בין העובדים, לחזק את גיבוש הצוות, וליצור זיכרונות יוצאי דופן. אנו מתאימים כל אירוע בהתאם לצרכים הייחודיים של הקבוצה שלכם וכוללים משחקים מותאמים, פעילויות תחרותיות, ועוד הפתעות. בסיום, תוכלו ליהנות מאזור מיוחד למינגלינג, שתייה ואפילו נשנושים מותאמים.',
      imageSrc: 'assets/Company_Event.jpg'
    },
    {
      title: 'ימי הולדת',
      description: 'חוגגים יום הולדת? הפכו את היום הזה לחוויה בלתי נשכחת עם פעילויות גיימינג ושמחה כמו שלא חוויתם מעולם. בחרו מתוך מגוון חדרי המשחקים והאטרקציות שלנו ותיהנו מחוויה חגיגית שתשאיר את כל המשתתפים מרוצים. בין אם מדובר בילדים, נוער או מבוגרים, אנו נוכל להתאים את החוויה בדיוק לרצונותיכם עם משחקים מרתקים, אזורי ישיבה למנוחה, וכיבוד שמותאם ליום החגיגה.',
      imageSrc: 'assets/Birthday_Event.jpg'
    },
    {
      title: 'מסיבת רווקים/רווקות',
      description: 'לפני היום הגדול? מסיבת רווקים/רווקות היא ההזדמנות שלכם לשחרר, לצחוק ולהשתגע באווירה שכולה כיף ואקשן. בואו לערוך את המסיבה שלכם במתחם הגיימינג שלנו וליהנות ממשחקים קבוצתיים מהנים, תחרויות מאתגרות, וחוויה שתשאיר אתכם עם חיוך. כאן המקום שלכם להרפתקה בלתי נשכחת הכוללת משחקים משותפים, אזורי VIP פרטיים, ומבחר אפשרויות למוזיקה ושתייה כדי שהכל יהיה בדיוק כפי שתכננתם.',
      imageSrc: 'assets/Bachelor_Party.jpg'
    },
    {
      title: 'אירוע פרטי אחר',
      description: 'מתכננים אירוע אישי ומיוחד? בין אם מדובר בערב קוקטייל אלגנטי, טורניר גיימינג או כל רעיון אחר, אנחנו כאן כדי להפוך אותו למציאות ולוודא שהחוויה תתאים בדיוק לציפיות שלכם. צוות המתחם שלנו ישמח לעזור לכם בתכנון והפקת כל פרט, ולהעניק לאורחים שלכם חוויה שלא ישכחו. כולל חדרים פרטיים, משחקים בלעדיים, והפתעות נוספות כדי שהאירוע שלכם יהיה בדיוק כמו שרציתם.',
      imageSrc: 'assets/Private_Event.jpg'
    }
  ];
}
