import { Component } from '@angular/core';

@Component({
  selector: 'app-company-events',
  templateUrl: './company-events.component.html',
  styleUrls: ['./company-events.component.scss'],
})
export class CompanyEventsComponent {
  events = [
    {
      title: 'אירועי חברה',
      description:
        'מתכננים אירוע חברה בלתי נשכח? הצטרפו אלינו לחוויית גיימינג ייחודית שמחברת בין צוותים ומשדרגת את הגיבוש הארגוני. אנו מציעים פעילויות מהנות ומאתגרות המותאמות במיוחד לקבוצות, כדי להבטיח שיתוף פעולה ואווירה תחרותית ומלאת אנרגיה. בואו ליצור רגעים בלתי נשכחים עם עמיתים ולהנות מחוויות שלא יישכחו בקרוב, בסביבה טכנולוגית ומעוררת השראה.',
      imageSrc: 'assets/Company_Event.jpg',
    },
    {
      title: 'ימי הולדת',
      description:
        'חוגגים יום הולדת? הפכו את החגיגה לחוויה יוצאת דופן עם משחקים מרתקים ואווירה בלתי נשכחת לכל הגילאים. אנחנו דואגים לכל הפרטים כדי שכולם ייהנו, עם מגוון משחקים המותאמים גם לילדים וגם למבוגרים. אתם מוזמנים להביא חברים ומשפחה ולהפוך את יום ההולדת שלכם להרפתקה של ממש, עם עמדות משחק מתקדמות ואווירה שתשאיר חיוך על פניהם של כולם.',
      imageSrc: 'assets/Birthday_Event.jpg',
    },
    {
      title: 'מסיבת רווקים/רווקות',
      description:
        'לפני היום הגדול, בואו להשתחרר במסיבת רווקים/רווקות מלאה באקשן, צחוק וחוויות בלתי נשכחות עם החברים הקרובים. החגיגה כוללת משחקים תחרותיים ומאתגרים, מסלולי VR מהפכניים, ותחנות כיף המותאמות בדיוק לאירוע הזה. תנו לעצמכם להתנתק מהלחצים ולהנות מערב שאין כמותו, עם חוויות שישאירו את כל החברים והחברות מלאי סיפורים וזיכרונות.',
      imageSrc: 'assets/Bachelor_Party.jpg',
    },
    {
      title: 'אירועים פרטיים',
      description:
        'מתכננים אירוע ייחודי? אנחנו כאן כדי להתאים עבורכם את החוויה המושלמת, בין אם זה ערב גיימינג, טורניר או מפגש חברתי. תוכלו לבחור מתוך מגוון רחב של אפשרויות אירוח, כולל מסיבות אינטימיות או מפגשים מורחבים, עם עמדות משחק מתקדמות, חדרי VIP, והפתעות מיוחדות לכל אורח. בואו ליצור אווירה בלתי נשכחת עם כל מי שחשוב לכם, וליהנות מחוויה אישית ומותאמת לצרכים שלכם.',
      imageSrc: 'assets/Private_Event.jpg',
    },
  ];
}
